app/Http/Livewire/UserList.php

    public function render()
    {
        return view('livewire.user-list', [
            'users' => User::where('name', 'like', '%'. $this->filter . '%')
                            ->orWhere('prenom', 'like', '%'. $this->filter . '%')
                            ->paginate(10),
        ]);
---
select * from `users` where (`name` like '%%' or `prenom` like '%%') and `users`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `users` where (`name` like '%%' or `prenom` like '%%') and `users`.`deleted_at` is null