app/Http/Controllers/UsersController.php

select * from `roles` order by `created_at` desc
---
    public function store(User $user, StoreUserRequest $request)
    {
        $user = $user->create(array_merge($request->validated(), [ "password" =>$this->generateRandomString()]));
        // partie photo //
        if ($request->file('photo')){
            $filename = $user->id.'.'.$request->file('photo')->extension();
            $path = $request->file('photo')->storeAs(
                                                'photos', //repertoire
                                                $filename , //nom fichier
                                                'public' // espace de stockage
                                            );
            $user->photo=$path;
        }
        if ($request->has('socle'))
            $user->socle = true;
        else
            $user->socle = false;
        if ($request->has('comete'))
            $user->comete = true;
        else
            $user->comete = false;

        $user->name = strtoupper($user->name);
        $user->prenom = ucfirst(strtolower($user->prenom));
        $user->display_name = $user->displayString();
        $user->save();
        $user->syncRoles($request->get('role'));

        if (is_null($request->get('role')) or ! in_array("user", $request->get('role')))