app/Models/User.php

select `fonctions`.*, `user_fonction`.`user_id` as `pivot_user_id`, `user_fonction`.`fonction_id` as `pivot_fonction_id`, `user_fonction`.`created_at` as `pivot_created_at`, `user_fonction`.`updated_at` as `pivot_updated_at`, `user_fonction`.`date_lache` as `pivot_date_lache`, `user_fonction`.`valideur_lache` as `pivot_valideur_lache`, `user_fonction`.`commentaire_lache` as `pivot_commentaire_lache`, `user_fonction`.`date_double` as `pivot_date_double`, `user_fonction`.`valideur_double` as `pivot_valideur_double`, `user_fonction`.`commentaire_double` as `pivot_commentaire_double`, `user_fonction`.`validation` as `pivot_validation`, `user_fonction`.`taux_de_transformation` as `pivot_taux_de_transformation` from `fonctions` inner join `user_fonction` on `fonctions`.`id` = `user_fonction`.`fonction_id` where `user_fonction`.`user_id` = 66
---
    public function pourcentage_valides_pour_fonction(Fonction $fonction, bool $fullcalc = false)
    {
        if (!$fullcalc) {
            $workitem = $this->fonctions()->find($fonction);